Repository: nickAS21/floor_flutter_front
Catalog: lib/l10n/intl_*.arb
Languages: uk

# apiError
source: API: {apiUrl} - no internet connection
uk: API: {apiUrl} - немає підключення до інтернету

# serverError
source: API: {apiUrl} - invalid server response
uk: API: {apiUrl} - помилка відповіді від сервера

# formatError
source: API: {apiUrl} - invalid response format
uk: API: {apiUrl} - помилка в форматі запиту

# credentialsError
source: Invalid Credentials
uk: Недійсні облікові дані

# titleRegLogin
source: Registration and Login
uk: Реєстрація та вхід

source: Sign In
uk: Увійти

source: Username
uk: Ім`я користувача

source: Password
uk: Пароль

# enterCustomAPI
source: Enter custom API (optional)
uk: Введіть API користувача (необов`язково)

# windowSize
source: Window is
uk: Розмір вікна

# solarPanel
source: Solar Panels
uk: Сонячні Панелі

source: Battery
uk: Батарея

source: Grid
uk: Електромережи

source: Load
uk: Споживання

# dailySolarPanel
source: Daily Solar
uk: Щоденне Сонячні Панелі

source: Daily Battery Charge
uk: Щоденний Заряд Батареї

source: Daily Battery Discharge
uk: Щоденний Розаряд Батареї

source: Daily Grid
uk: Щоденне від Електромережи

source: Daily Load
uk: Щоденне Споживання

# aboutDialogTitle
source: Oasis: Solar & Smart Home Ecosystem
uk: Oasis: Екосистема сонячної енергії та розумного дому

# aboutDialogTitleDop
source: Technical Details:
uk: Додаткова інформація:

# aboutDialogMessage
source: • Smart control of solar inverter-based equipment • Seamless management for apartments and country houses • Real-time battery and power grid monitoring • Remote discharge depth adjustment (60%, 50%, etc.) • Advanced charge mode control (Auto/Manual) • Comprehensive system logs and error tracking
uk: • Інтелектуальне керування обладнанням на базі сонячних інверторів • Єдиний інтерфейс для керування квартирою та заміським будинком • Моніторинг стану акумуляторів та електромережі в реальному часі • Дистанційне налаштування глибини розряду (60%, 50% тощо) • Керування режимами зарядки (Автоматичний/Ручний) • Перегляд системних журналів та відстеження помилок

# aboutDialogMessageSettingsBms
source: This application is optimized for GBL_2.45K3 batteries by GS Energy Storage (SYL Battery). Reliable operation requires configuration of the USR-WIFI232-B2/A2 Wi-Fi module.
uk: Цей застосунок оптимізовано для роботи з акумуляторами GBL_2.45K3 від GS Energy Storage (SYL Battery). Для коректної роботи необхідна конфігурація Wi-Fi модуля USR-WIFI232-B2/A2.

# versionInfo
source: Version:
uk: Версія:

# authorInfo
source: Author:
uk: Автор:
